<!--注册协议-->
<template xmlns:v-bind="http://www.w3.org/1999/xhtml">
  <div class="registration-agreement">
    <c-title :text="title" :hide="false"></c-title>
    <div class="borderTop"></div>
    <div class="model">
      <!--<h3>用户注册及服务协议</h3>-->
      <p class="intro">天津普惠商融融资租赁有限公司（以下简称“普惠商融”）通过其运营的【车贷】手机应用程序（以下简称“【车贷】”）获取用户的融资租赁需求，并由普惠商融及其关联方（关联方包括但不限于凡普互金有限公司，普惠商融及其关联方以下合称“服务方”）为用户提供融资租赁服务、租赁交易咨询、信用审核、合同管理、交易管理等服务（以下简称“服务”）。本《用户注册及服务协议》（以下简称“本协议”）是用户与服务方之间订立的关于用户在【车贷】进行注册、登录以及使用【车贷】服务的协议。本协议适用于用户在【车贷】的全部活动。</p>
      <p class="intro">服务方特别提醒用户认真阅读本协议，确保用户在注册成为【车贷】用户前，已充分理解本协议中的所有条款，特别是其中涉及的对服务方免责的条款以及对用户权利限制的条款。除非用户接受本协议所有条款，否则用户无权在【车贷】进行注册、登录或者使用【车贷】服务。用户的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束，用户不得以未签署书面协议为由，否认本协议的效力。服务方有权通过【车贷】向用户公布关于【车贷】服务的规则，该等规则构成本协议不可分割的一部分，与本协议具有同等法律效力。</p>
      <p class="intro">在本协议履行过程中，服务方有权根据实际情况对本协议的相关条款进行修改，一旦本协议的内容发生变动，服务方将通过【车贷】公布最新的协议文本。如果用户不同意服务方对本协议所做的任何修改，用户有权停止使用【车贷】服务。如果用户继续使用【车贷】服务，则视为用户接受服务方对本协议所做的修改，并应遵照修改后的协议履行应尽义务。</p>
      <div>
        <h6>第一条	用户注册</h6>
        <p>1.1	在使用【车贷】服务前，用户必须先在【车贷】上进行注册。注册用户必须是中华人民共和国境内（不包括中华人民共和国香港特别行政区、澳门特别行政区及台湾地区）具有完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人。用户不具备上述资格的，应当立即终止注册、登录以及停止使用【车贷】服务，否则，用户的监护人应当承担一切法律责任。服务方有权对不具备注册资格的用户随时终止注册、登录以及停止提供【车贷】服务，造成损失的，用户及其监护人应当承担赔偿责任。</p>
        <p>1.2	用户应当使用尚未注册的手机号码在【车贷】进行注册，并设置相应的密码。注册成功后，用户将取得一个与其注册所用手机号码对应的【车贷】账号。【车贷】账号及密码由用户负责保管，用户应当对通过其【车贷】账号进行的所有活动承担法律责任。任何经由用户【车贷】账号发出的指令均视为用户本人的行为和真实意思表示，由此产生的一切责任和后果由用户本人承担。</p>
        <p>1.3	【车贷】服务的部分内容需要用户根据要求完成身份认证及/或银行卡认证，未进行身份认证及/或银行卡认证的用户将无法使用该部分【车贷】服务。因未能完成认证而无法享受【车贷】服务造成的损失，服务方不承担任何责任。</p>
        <p>1.4	用户有义务提供有效的联系方式，包括但不限于手机号码、联系地址、工作单位、联系人信息、常用电子邮箱等。联系方式发生变更时，用户应当在3日内进行更新。因用户操作不当或填写的联系方式有误，导致服务方无法正常提供【车贷】服务的，造成的损失及法律后果由用户自行承担。</p>
        <p>1.5	如用户发现有他人冒用或盗用其【车贷】账号及密码，或进行任何其他未经其合法授权行为的，应立即以书面方式通知【车贷】并要求暂停服务，【车贷】将积极响应用户的要求。用户应当理解，对用户的要求采取行动需要合理期限，在此之前，【车贷】对已执行的指令及/或所导致的用户损失不承担任何责任。</p>
      </div>
      <div>
        <h6>第二条	服务内容</h6>
        <p>2.1	服务方将恪尽职守，本着依法、诚实、信用、自愿、公平、谨慎、有效管理的原则，为用户提供融资租赁服务、租赁交易咨询、信用审核、合同管理、交易管理等服务。服务方向用户提供服务的具体内容，以本协议、服务方与用户签订的融资租赁合同等相关协议以及服务方通过【车贷】不时公布的规则为准。</p>
        <p>2.2	为向用户提供【车贷】服务，服务方会要求用户通过【车贷】提供和上传个人资料信息，用户有义务确保其提供的个人资料信息的真实性、准确性和完整性，并承诺对个人资料信息及时进行更新。如服务方基于合理判断认定用户提供的个人资料信息存在错误、虚假、不完整或未及时更新的，服务方有权立即单方面终止用户【车贷】账号的使用、拒绝用户使用全部或者部分【车贷】服务。在此情况下，服务方不承担任何责任，并且用户同意负担因此所产生的直接或间接的任何支出或损失。</p>
        <p>2.3	基于用户通过【车贷】提供的个人资料信息，服务方将从用户在【车贷】的活动追踪或者自行从公开渠道、第三方渠道或私人渠道等合法渠道收集用户其他个人资料信息。用户授权服务方通过上述渠道追踪、收集其个人资料信息，并授权服务方根据用户提供的及服务方自行追踪、收集的各项信息，对用户的还款能力、还款意愿和资产状况进行分析、评估，评审出用户在【车贷】上所拥有的个人信用等级。 </p>
        <p>2.4	根据服务方对用户个人信用等级的评审结果，普惠商融有权根据关联方提供的信息和/或服务决定是否向用户提供服务，但普惠商融不对提供服务做出任何承诺，且普惠商融的关联方不对信息的真实性、准确性、完整性和合法性作出保证。用户与普惠商融因融资租赁发生的或与融资租赁有关的任何纠纷，应由双方自行解决，普惠商融的关联方不承担任何交易风险及法律责任。</p>
        <p>2.5	通过【车贷】签署的融资租赁合同等相关协议可以采用电子签名形式签署电子合同和/或纸质形式签署纸质合同的任何一种或多种方式。用户以【车贷】账号在【车贷】通过点击确认数字证书服务协议并生成用户专属的电子签章后，通过点击确认、填写手机验证码或类似方式使用数字证书签署融资租赁合同等相关协议；电子签名签署即视为用户本人真实意思表示，具有法律效力。用户应妥善保管自己的【车贷】账号和密码，用户通过前述方式订立的电子合同对合同各方具有法律约束力，用户不得以其【车贷】账号和密码被盗用或其他理由否认已订立的合同的效力或不按照该等合同履行相关义务。服务方向用户提供电子合同和电子账单的备案、查阅和发送服务。用户在【车贷】绑定的电子邮箱作为其电子合同及其他重要通知的接收邮箱，用户应当在注册成功后尽快绑定电子邮箱并密切关注邮箱信息。</p>
        <p>2.6	为确保网络交易便捷、安全，服务方及用户可根据交易需要使用专业认证机构提供的电子签章完成融资租赁合同等相关协议的签署及交易行为确认。用户同意授权服务方将用户相关信息提交至专业认证机构，代其申请专属于用户的电子签章，该等电子签章将被作为在【车贷】签署电子合同等法律文本之目的使用。</p>
        <p>2.7	为确服务的资金安全，服务方会根据交易需要委托银行或第三方支付机构开立交易结算资金账户，为用户提供资金保管、资金充值、资金冻结、资金代付、资金代收、资金提取、资金查询等资金管理服务。用户知悉并授权服务方将用户相关信息提供给银行或第三方支付机构，由银行或第三方支付机构进行账户开立、资金管理服务等操作。</p>
        <p>2.8	用户知悉并同意，对于用户使用【车贷】服务过程中涉及由银行或第三方支付机构等第三方提供的相关服务的责任由该第三方承担，服务方不承担该等责任。服务方不承担责任的情形包括但不限于：（1）因银行、第三方支付机构等第三方未按照用户和/或服务方指令进行操作引起的任何损失或责任；（2）因银行、第三方支付机构等第三方原因导致资金未能及时到账或未能到账引起的任何损失或责任；（3）因银行、第三方支付机构等第三方对交易限额或次数等方面的限制而引起的任何损失或责任；（4）其他因第三方的行为或原因导致的任何损失或责任。</p>
        <p>2.9	用户同意服务方为用户提供还款管理服务。服务方根据用户授权对用户进行还款资金的划扣，并有权在用户逾期还款时，自行或委托第三方催收机构对用户进行违约提醒及催收工作。</p>
        <p>2.10	用户了解并同意，其为进行交易所发出的任何指示或指令，均为不可撤销、不可逆转的指示或指令，用户不能以任何理由拒绝付款或要求取消交易。</p>
      </div>
      <div>
        <h6>第三条	用户信息及隐私保护</h6>
        <p>3.1	为了更加充分的了解用户情况，以便向用户提供更好的融资租赁服务、租赁交易咨询、信用审核、还款管理、租金催收等相关服务，用户充分理解并授权，服务方有权从用户在【车贷】的活动追踪用户个人资料信息，以及自行通过其他公开渠道、第三方渠道或私人渠道等合法渠道收集用户个人资料信息。</p>
        <p>3.2	用户授权服务方，对于用户自主提供的个人身份资料信息及个人财产资料信息（以下简称“个人资料信息”）、从用户在【车贷】的活动所追踪的用户个人资料信息以及通过其他方式自行收集的用户个人资料信息，享有合理使用、披露的权利。服务方基于履行协议、提供服务、解决争议、保障交易安全、控制交易风险等目的使用用户个人资料信息的，无需另行告知用户。</p>
        <p>3.3	用户授权服务方，除法律另有规定之外，基于为用户提供更优质服务之目的，向服务方因服务必要开展合作的伙伴提供、查询、收集用户必要的个人资料信息。</p>
        <p>3.4	用户授权服务方，对于用户提供的个人资料信息、从用户在【车贷】的活动所追踪的用户个人资料信息，以及通过其他方式自行收集的用户个人资料信息，在不透露用户个人隐私资料的前提下，有权对整个用户数据库进行分析并对用户数据库进行商业利用。</p>
        <p>3.5	基于服务用户之目的，服务方有权通过使用和分析用户的个人资料信息，向用户提供其可能感兴趣的产品或服务信息，或与服务方的合作方共享信息，以便合作方向用户展示其产品或服务信息。</p>
        <p>3.6	服务方对于用户提供的以及其自行追踪、收集的用户个人资料信息，不会恶意出售或免费共享给任何第三方。但在下列情形下，服务方有权依法或根据约定在必要范围内披露用户个人资料信息：</p>
        <p>3.6.1	根据法律法规、司法程序或政府主管部门、行业自律组织的要求；</p>
        <p>3.6.2	为建立信用体系，服务方有权将用户个人资料信息提供给依法设立的征信机构（包括但不限于普惠小爱征信有限公司）；</p>
        <p>3.6.3	为维护服务方的合法权益，在用户拒绝履行还款义务或者存在欺诈的情形下，服务方有权将用户的个人资料信息以及具体违约、欺诈情形对外披露、录入黑名单系统、提供给第三方催收机构或者向用户联系人以及社会公众发布。由此给用户造成的任何损失，服务方不承担法律责任；</p>
        <p>3.6.4	事先获得用户同意或授权的其他情形。 </p>
        <p>3.7	服务方将按照行业标准和惯例，采取合理、必要的手段及措施对用户提供的、其自行追踪、收集的用户个人资料信息进行保护。用户应当理解，保护措施可能受限于技术水平而不能完全确保用户个人资料信息不会通过本协议中未列明的途径泄露出去。针对本协议约定情形下的个人资料信息使用及披露有可能给用户造成的损失，服务方不承担任何责任。</p>
        <p>3.8	本条款所约定的用户授权及隐私保护内容，具有独立法律效力并永久持续有效，不因本协议效力状态的变化而变化，也不因【车贷】相关交易规则或融资租赁合同等相关协议的变更、解除或终止而变化。</p>
      </div>
      <div>
        <h6>第四条	用户的承诺及义务</h6>
        <p>4.1	用户承诺绝不以任何非法目的或以任何非法方式使用【车贷】服务，并承诺遵守法律法规及其他规范性文件，遵守所有与【车贷】服务有关的协议和规则。因违背上述承诺造成的损失及后果，用户自行承担全部责任。</p>
        <p>4.2	用户承诺不得利用【车贷】服务侵害他人合法权益，进行违法或不正当的活动，包括但不限于：</p>
        <p>4.2.1	侵害他人名誉、隐私权、商业秘密、商标权、著作权等知识产权及其他权益；</p>
        <p>4.2.2	违反依照法律规定或协议约定应当承担的保密义务；</p>
        <p>4.2.3	冒用他人名义使用【车贷】服务；</p>
        <p>4.2.4	利用服务提供资金从事任何不法活动，如贩卖枪支、毒品、盗版软件或其他违禁物，反国家、恐怖融资等违法犯罪活动，或以服务提供资金支持、资助或变相帮助反国家、恐怖组织从事非法活动；</p>
        <p>4.2.5	涉嫌洗钱、套现或进行传销活动；</p>
        <p>4.2.6	从事任何可能含有电脑病毒或者可能侵害【车贷】服务系统、资料等行为；</p>
        <p>4.2.7	利用【车贷】服务系统进行可能对互联网或移动通讯设备正常运转造成不利影响的行为；</p>
        <p>4.2.8	侵犯服务方的商业利益，泄露商业机密；</p>
        <p>4.2.9	利用【车贷】服务上传、展示或传播虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；</p>
        <p>4.2.10	其他【车贷】有正当理由认为不适当的行为。</p>
        <p>4.3	用户违反本协议或融资租赁合同等相关协议的约定，导致任何第三方向服务方主张任何索赔要求的，服务方有权要求用户进行赔偿，并视用户行为的性质，采取包括但不限于暂停服务、终止服务、限制使用、回收【车贷】账号、追究法律责任在内的各项措施。对恶意注册【车贷】账号或利用【车贷】账号进行违法活动、侵犯第三方合法权益的，服务方有权回收其【车贷】账号，将违法行为及有关信息资料进行公示、计入用户信用档案、按照法律规定提供给有关政府机构或按照协议约定提供给第三方；构成犯罪的，服务方将根据司法部门的要求，协助调查。</p>
        <p>4.4	用户不得对本协议及【车贷】服务的任何部分，以及基于本协议或【车贷】服务之使用而获得的其他用户和交易对方信息或商业机密，进行出售或用于任何其它商业目的。</p>
      </div>
      <div>
        <h6>第五条	免责条款</h6>
        <p>5.1	服务方对所有服务将尽力维护其安全性及方便性，但由于互联网服务的特殊性，服务方对服务中出现的中断、信息删除或储存失败等，不承担任何责任。</p>
        <p>5.2	使用互联网服务可能会受到各个环节不稳定因素的影响，存在因不可抗力、计算机病毒、黑客攻击、系统不稳定、用户所在位置、用户关机或手机感染病毒以及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足用户要求的风险，用户需充分理解并自行承担上述风险，服务方不承担任何责任。</p>
        <p>5.3	用户因第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而遭受的经济损失，服务方不承担任何责任。</p>
        <p>5.4	服务方的合作方提供的服务内容由该合作方负责。用户享用相关服务时产生的争议、纠纷及损失，服务方不承担任何责任。</p>
      </div>
      <div>
        <h6>第六条	知识产权保护</h6>
        <p>6.1	【车贷】程序及其上内容的知识产权均由服务方依法拥有，包括但不限于文字、软件、声音、图片、录像、图表等，除非事先经服务方的合法授权，任何人皆不得擅自以任何形式使用、修改、复制、公开发布【车贷】程序或/及其上内容，或者创造与内容有关的派生产品。</p>
        <p>6.2	用户必须依法尊重服务方的知识产权，否则，服务方有权立即终止向用户提供服务，并依法追究其法律责任，要求用户赔偿【车贷】一切损失。</p>
      </div>
      <div>
        <h6>第七条	通知</h6>
        <p>7.1	本协议项下的通知如以在【车贷】或者服务方公示方式作出，一经公示即视为已经送达。除此之外，其他向用户发布的具有专属性的通知将由服务方向用户提供的手机号码、电子邮箱或用户在【车贷】的站内消息系统栏发送，一经发送即视为已经送达。用户应当密切关注手机短信、电子邮件及【车贷】的站内消息，用户不得以未收到或未阅读该等通知而主张相关通知未予送达。</p>
      </div>
      <div>
        <h6>第八条	其他条款</h6>
        <p>8.1	本协议自用户成功注册为【车贷】用户之日起生效，除服务方终止本协议或用户丧失【车贷】注册用户资格外，本协议始终有效。出于运行和交易安全的需要，服务方有权暂时停止提供或者限制【车贷】服务的部分功能，或提供新功能，在任何功能减少、增加或者变化时，只要用户仍然使用【车贷】服务，则表示用户仍然同意本协议或变更后的协议。</p>
        <p>8.2	本协议终止并不免除用户对根据本协议或融资租赁合同等相关协议达成的服务所应承担的义务和责任。</p>
        <p>8.3	服务方未行使本协议中约定的任何权利，不构成对该权利的放弃。</p>
        <p>8.4	本协议的订立、执行和解释适用中华人民共和国法律。如本协议的任何条款与适时法律规定相抵触或因任何其他原因而不具有可执行性，则该条款无效，但并不影响本协议其他条款继续有效。</p>
        <p>8.5	若用户和服务方之间发生任何纠纷和争议，应友好协商解决，协商不成，用户同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</p>
        <p>8.6	本协议签订地为中华人民共和国北京市东城区。</p>
        <p>8.7	本协议最终解释权归服务方所有，在法律法规允许的范围内，服务方保留一切解释和修改的权利。</p>
      </div>
      <div class="footer">天津普惠商融融资租赁有限公司</div>
    </div>
  </div>
</template>

<script>
  import cTitle from 'components/title';

  export default {
    data () {
      return {
        title: '用户注册及服务协议',
      }
    },
    components: {cTitle}
  }

</script>

<style lang="scss" rel="stylesheet/scss" scoped>
  .registration-agreement{
    width: 100%;
    height: 100%;
    font-family: YouYuan, Tahoma, STXihei;
    .borderTop{
      width: 100%;
      height: 1px;
      background: #ccc;
    }
    .model{
      background-color: #fff;;
      padding-left: .32rem;
      padding-right: .32rem;
      color: #595959;
      margin-bottom: .5rem;
      h3{
        font-size: .3rem;
        margin: 0 0 .38rem;
        text-align: center;
        font-weight: normal;
        padding-top: .5rem;
        line-height: .36rem;
      }
      p.intro{
        text-align: justify;
        font-size: .26rem;
        margin: .2rem 0 0 0;
        text-indent: .55rem;
        line-height: .36rem;
      }
      div{
        width: 100%;
        h6{
          font-weight: normal;
          margin: .38rem 0 0 0;
          font-size: .26rem;
          line-height: .36rem;
        }
        p{
          text-align: justify;
          margin: .38rem 0 0 0;
          font-size: .26rem;
          line-height: .36rem;
        }
      }
      .footer {
        margin: .38rem 0 0 0;
        text-align: right;
      }
    }
  }
</style>